---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures
source: html/519eb5ad-3ab7-82d6-5e16-64c5134c862d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures

Failures about Illumination.

## Syntax (C#)
```csharp
public static class IlluminationFailures
```